# Brewfile

# Set up caskroom and install xquartz
cask_args appdir: "/Applications"
tap "caskroom/cask"
cask "xquartz"

## Install CLI programs using brew
brew "ack"
brew "bash"
brew "bash-completion"
brew "brew-cask-completion"
brew "cheat"
brew "coreutils"
brew "curl"
brew "git"
brew "diff-pdf"
brew "exiftool"
brew "gnuplot", args: ["with-cairo", "with-pdflib-lite", "with-qt", "with-wxmac", "with-x11"]
brew "htop"
brew "imagemagick"
brew "mas"
brew "todo-txt"
brew "tree"
brew "vagrant-completion"
brew "vim", args: ["with-override-system-vi"]
brew "wget"
brew "z"

## Tools that only get very sporadic use
# brew "ffmpeg", args: ["with-fdk-aac"]
# brew "gcc"
# brew "gcc", args: ["without-multilib"] # VERY SLOW: ~40 minutes
# brew "gifsicle"       # handling and optimizing gifs
# brew "lcdf-typetools" # dealing with Adobe fonts for LaTeX
# brew "pandoc"         # converting between document formats
# brew "potrace"        # creating vector images of signatures
# brew "tesseract"      # process image files into text with OCR
# brew "innoextract"    # for extracting GOG executables (for old games)

## Install GUI programs using cask
cask "1password"
cask "sublime-text"
cask "iterm2"
cask "github"
mas "PCalc", id: 403504866
cask "spectacle"
cask "nvalt"
cask "skim"
cask "zotero"
cask "dropbox"
cask "daisydisk"
cask "keka"
cask "appcleaner"
cask "r-name"
cask "virtualbox"
cask "vlc"
cask "spotify"
cask "skype"
cask "transmission"
cask "whatsapp"
cask "qlstephen"
cask "mactex"
cask "vagrant"
cask "firefox"
